Autodesk.Revit.DB.Fabrication.FabricationHandlePosition
Position of fabrication part valve handle.
Since:
2027

Autodesk.Revit.DB.Fabrication.FabricationHandlePosition.Swept
Swept displaying the fully swept geometry from open to closed.

Autodesk.Revit.DB.Fabrication.FabricationHandlePosition.Open
Open position.

Autodesk.Revit.DB.Fabrication.FabricationHandlePosition.Closed
Closed position.

Autodesk.Revit.DB.Fabrication.FabricationHandlePosition.Undefined
Undefined handle position.